package fc.java.part4;

/*
    상속: 부모가 자식들에게 자신의 것을 사용하라고 허락해 주는 것
    상속이란? : 어떤 데이터를 담아야 하는데 나에게 바구니가 없다면 다른 사람이 가지고 있는 바구니를 사용하면 된다.
               그런데 나와 다른 사람은 아무런 관계가 없기 때문에 다른 사람의 바구니를 사용하지 못한다.
               하지만 나의 부모를 생각해보자. 부모에게 바구니가 있으면 자식은 부모의 바구니를 사용할 수 있다.(단, 허락, 상속해주면)
            -> 자식과 부모는 상속 관계이기 때문에 자식은 부모의 것을 얼마든지 사용 가능하다.

    - 회사의 사원 클래스를 수평적 구조로 설계한다고 가정해보자.
    1. 코드의 중복이 발생
    2. 새로운 요구 사항 발생시 반영이 어렵다.(유지 보수가 어렵다.)
    3. 확장성이 떨어진다.

    - 회사의 사원 클래스를 수직적 구조로 설계한다고 가정해보자.
    1. 코드의 중복 부분 최소화
    2. 새로운 요구 사항 발생시 반영이 쉽다.
    3. 확장성이 좋아진다.

    단일 상속 : 부모를 한 명으로 두고 상속을 받는 구조(자바에서는 단일 상속만 지원)
 */

public class Inheritance {
}
