public class VDA {
    // 변수(V) : 데이터를 저장하는 메모리 공간의 이름
    // 자료형(D) : 변수의 크기와 어떤 종류의 데이터를 저장할 것인지를 결정하는 것
    // 할당(A) : 변수에 데이터를 저장하는 것

    // 변수를 만들 때 고려되는 것? -> 크기와 데이터의 종류
    // 기본자료형의 크기와 종류
    // byte -> 1byte -> 정수
    // short -> 2byte -> 정수
    // int -> 4byte -> 정수
    // long -> 8byte -> 정수
    // float -> 4byte -> 실수
    // double -> 8byte -> 실수
    // char -> 2byte -> 문자 (C언어에서는 1byte를 사용하지만 Java에서는 2byte를 사용함으로써 비영어권의 문자도 깨지지 않고 저장 가능)
    // boolean -> 1byte -> 참,거짓

    // 사용자정의 자료형(객체자료형) -> 개발자가 만들어서 사용하는 자료형
}
